cases/hydrodynamic/stationaryDroplet3D/divNormalTest/templateCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoPandoraFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         0.1;

writeControl    timeStep;

writeInterval   1000;

deltaT          1e-05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  14;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1e6;
maxAlphaCo      0.5;

maxDeltaT       1e6;

// Debugging: 
// - must be turned off for visualizing p_rgh at 0
//   after the solution of the YoungLaplaceEqn
//OptimisationSwitches
//{
//    fileHandler collated;
//}

functions 
{
    minMaxU 
    {
        type        fieldMinMax;
        libs        ("libfieldFunctionObjects.so");
        writeToFile yes;
        log         yes;
        location    yes;
        mode        magnitude;
        fields      (U);
    }
    curvatureEval
    {
        type                curvatureEvaluation;
        libs                ("libpandora");
        vofFieldName        alpha.dispersed;
        curvatureFieldName  cellCurvature;
        exactCurvature      1000.0;
    }
}

// ************************************************************************* //
